Autodesk.Revit.UI.TaskDialogResult
Enum to specify the task dialog result.
Since: 2011

Autodesk.Revit.UI.TaskDialogResult.CommandLink4
The return value for CommandLink whose Id is TaskDialogCommmandLinkId.CommandLink4.

Autodesk.Revit.UI.TaskDialogResult.CommandLink3
The return value for CommandLink whose Id is TaskDialogCommmandLinkId.CommandLink3.

Autodesk.Revit.UI.TaskDialogResult.CommandLink2
The return value for CommandLink whose Id is TaskDialogCommmandLinkId.CommandLink2.

Autodesk.Revit.UI.TaskDialogResult.CommandLink1
The return value for CommandLink whose Id is TaskDialogCommmandLinkId.CommandLink1.

Autodesk.Revit.UI.TaskDialogResult.Close
The return value for TaskDialogCommonButtons.Close.

Autodesk.Revit.UI.TaskDialogResult.No
The return value for TaskDialogCommonButtons.No.

Autodesk.Revit.UI.TaskDialogResult.Yes
The return value for TaskDialogCommonButtons.Yes.

Autodesk.Revit.UI.TaskDialogResult.Retry
The return value for TaskDialogCommonButtons.Retry.

Autodesk.Revit.UI.TaskDialogResult.Cancel
The return value for TaskDialogCommonButtons.Cancel or the task dialog is cancelled by ESC, Alt+F4 or the X close button.

Autodesk.Revit.UI.TaskDialogResult.Ok
The return value for TaskDialogCommonButtons.Ok.

Autodesk.Revit.UI.TaskDialogResult.None
Nothing is returned from the task dialog.